create_clock -period 4 -waveform {0 2} -name clk

set_clock_latency 0.03 clk

set_input_delay 0.2 -clock clk [all_inputs]

set_output_delay 0.165 -clock clk [all_outputs]

set_load 0.1 [all_outputs]

set_max_area 0



design/NangateOpenCellLibrary_typical_ccs.db
