Reports:

report_constraint -nosplit -all_violators > report/almost_correct_adder16_all_violators_report.txt

report_area > report/almost_correct_adder16_area_report.txt

report_timing > report/almost_correct_adder16_timing_report.txt

report_power > report/almost_correct_adder16_INACCURATE_power_report.txt


Netlist:

write -format verilog -hierarchy -output netlist/almost_correct_adder16_netlist.v


Constraint Files:

write_sdf -version 2.1 output/almost_correct_adder16_mapped.sdf

write_sdc -nosplit output/almost_correct_adder16_mapped.sdc

write_parasitics -o output/almost_correct_adder16_parasitics
